Revit 2024 API
StructuralSectionCParallelFlange Constructor
 Creates a new instance of Structural Section C Parallel Flange shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public StructuralSectionCParallelFlange(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double clearWebHeight,
	double flangeToeOfFillet,
	double webToeOfFillet,
	double boltSpacing,
	double boltDiameter
)
Visual Basic
Public Sub New ( _
	width As Double, _
	height As Double, _
	flangeThickness As Double, _
	webThickness As Double, _
	webFillet As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	principalAxesAngle As Double, _
	sectionArea As Double, _
	perimeter As Double, _
	nominalWeight As Double, _
	momentOfInertiaStrongAxis As Double, _
	momentOfInertiaWeakAxis As Double, _
	elasticModulusStrongAxis As Double, _
	elasticModulusWeakAxis As Double, _
	plasticModulusStrongAxis As Double, _
	plasticModulusWeakAxis As Double, _
	torsionalMomentOfInertia As Double, _
	torsionalModulus As Double, _
	warpingConstant As Double, _
	shearAreaStrongAxis As Double, _
	shearAreaWeakAxis As Double, _
	clearWebHeight As Double, _
	flangeToeOfFillet As Double, _
	webToeOfFillet As Double, _
	boltSpacing As Double, _
	boltDiameter As Double _
)
Visual C++
public:
StructuralSectionCParallelFlange(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double clearWebHeight,
	double flangeToeOfFillet,
	double webToeOfFillet,
	double boltSpacing,
	double boltDiameter
)
Parameters
width
Type: System.Double
 Section width.
height
Type: System.Double
 Section height, depth.
flangeThickness
Type: System.Double
 Flange Thickness.
webThickness
Type: System.Double
 Web Thickness.
webFillet
Type: System.Double
 Web Fillet - fillet radius between web and flange.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle
Type: System.Double
 Rotation angle between the principal axes and cross section reference planes.
sectionArea
Type: System.Double
 Cross section area.
perimeter
Type: System.Double
 Painting surface of the unit length.
nominalWeight
Type: System.Double
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis
Type: System.Double
 Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis
Type: System.Double
 Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis
Type: System.Double
 Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis
Type: System.Double
 Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis
Type: System.Double
 Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis
Type: System.Double
 Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia
Type: System.Double
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus
Type: System.Double
 Section modulus for calculations of torsion stresses (Ct)
warpingConstant
Type: System.Double
 Warping constant (Cw, Iomega, H)
shearAreaStrongAxis
Type: System.Double
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis
Type: System.Double
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
clearWebHeight
Type: System.Double
 Detailing depth between the web toes of the fillets, in.(mm)
flangeToeOfFillet
Type: System.Double
 Detailing distance from center of web to flange toe of fillet, in. (mm)
webToeOfFillet
Type: System.Double
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
boltSpacing
Type: System.Double
 Standard bolt spacing, in. (mm)
boltDiameter
Type: System.Double
 Maximum bolt hole diameter, in. (mm)
See Also
StructuralSectionCParallelFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace